// 201412-2 Z字形扫描.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//http://118.190.20.162/view.page?gpid=T20

#include <iostream>
#include <cstring>
#include <algorithm>


using namespace std;

const int N = 510;

int n;//n=0
int q[N][N];

int main()
{
    scanf("%d", &n);//输入表示n行n列
    //scanf_s
    //推荐用cin
    for (int i = 1; i <= n; i++)
        for (int j = 1; j <= n; j++)//开始输入矩阵
            cin>>q[i][j];//scanf("%d", &q[i][j]);

    for (int i = 2; i <= n * 2; i++)//开始斜着便利矩阵，i为行加列的和
        if (i % 2 == 0)//行加列的和为偶数的行是从下往上遍历的，第一列开始
        {
            for (int j = i - 1; j; j--)//(3,1)(2,2)(1,3)
                if (j >= 1 && j <= n && i - j >= 1 && i - j <= n)
                //横坐标 j必须在范围[1,n]内，不能越界
                //纵坐标 = i-j 必须在范围[1,n]内，不能越界
                    printf("%d ", q[j][i - j]);
        }
        else
        {
            for (int j = 1; j < i; j++)//从上往下，第一行开始
                //x+y=5  (1,4)(2,3)(3,2)(4,1)
                if (j >= 1 && j <= n && i - j >= 1 && i - j <= n)
                    printf("%d ", q[j][i - j]);
        }
}


// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧:
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
